print('+', 10 + 8)
print('-', 10 - 8)
print('/', 10 / 8)
print('/', 1 / 1)
# 取整数除，保留整数向下取整
print('//', 5 // 2)
print('//', 5.0 // 2)
# 取余数
print('%', 5 % 2)
# 幂 5的2次方
print('**', 5 ** 2)
# 优先级  幂>乘、除、取余、取整除>加减

# -----------------------------
print('-----------------------------')

a = 1
a = a + 1
print('a', a)
a += 1
print('a+=', a)
a -= 1
print('a-=', a)

# -----------------------------
print('-----------------------------')

# res = input("请输入：")
# print('输入内容：%s' % res)

# 转义字符 \t，通常空四个字符，缩进
print('我突然\t缩进了')
# \n换行
print('我突然\n换行了')
# r不转义
print(r'我突然\n换行了')


# -----------------------------
print('-----------------------------')

# pwd = input('请输入密码：')
# pwdRe = input('请输入二次密码：')
# if pwdRe == pwd:
#     print('两次密码一致')
# else:
#     print('两次密码不一致！！')

aa = 18
bb = 18
# and not or
if aa == bb and aa == 18:
    print('完全一样')
else:
    print('有一点不一样')
